---
kind: method
id: M:Autodesk.Revit.DB.GeomCombinationSet.Contains(Autodesk.Revit.DB.GeomCombination)
source: html/2fd2a61a-bb02-1f15-f23b-cc8016aeb142.htm
---
# Autodesk.Revit.DB.GeomCombinationSet.Contains Method

Tests for the existence of an GeomCombination within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	GeomCombination item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.GeomCombination`) - The element to be searched for.

## Returns
The Contains method returns True if the GeomCombination is within the set, otherwise False.